var mysql = require('mysql');
const lodash = require('lodash');
const mainBigData = require('./dazhongyi.json');
const mainData = require('./mainDataFile.json');

var connection = mysql.createConnection({
  host: '127.0.0.1',
  user: 'root',
  password: 'root123456',
  database: 'test'
});

connection.connect();

var sql = 'SELECT * FROM fangji';
// var sql = 'SELECT * FROM zhongyao';
//查
connection.query(sql, function (err, result) {
  if (err) {
    console.log('[SELECT ERROR] - ', err.message);
    return;
  }

  const newData = [];
  // allLength = 25427
  // const allArr = Array.from(new Array(25427).keys());
  // const index_id_arr = [];
  // for1:
  // for (let idx = 0; idx < result.length; idx++) {
  //   const item2 = result[idx];
  //   index_id_arr.push(item2.index_id);
  // }
  // for (let index = 0; index < allArr.length; index++) {
  //   if(index_id_arr.indexOf(index+1) == -1) {
  //     // console.log(index+1);
  //     mainData[index]['index_id'] = index+1;
  //     newData.push(mainData[index]);
  //   }
  // }
  // console.log(newData);

  for (let index = 0; index < result.length; index++) {
    const item = result[index];
    if(
      // lodash.includes(item.children, '胃热') &&
      // lodash.includes(item.children, '食少')
      // lodash.includes(item.children, '伤寒论')

      // lodash.includes(item.children, '心下痞硬')
      // lodash.includes(item.children, '食少')

      lodash.includes(item.children, '呃逆') &&
      lodash.includes(item.children, '胃热')

      // lodash.includes(item.children, '困倦') &&
      // lodash.includes(item.children, '食少') &&
      // lodash.includes(item.children, '胃热')

      // lodash.includes(item.children, '腹中结块')
    ) {
      newData.push(item.name);
    }
  }
  console.log(JSON.stringify(newData))

});

// ["安息香丸","安神定智汤","安肾丸","安胎和气饮","艾附四神丸","保元汤","保元汤","保痘汤","保真汤","保真汤","保金汤","保阴煎","保阴煎","八仙糕","八物汤","八珍散","八珍益母丸","八珍糕","北亭丸","北亭圆","半夏茯苓汤","斑蝥散","柏叶散","柏子养心汤","白扁豆粥","白术厚朴汤","白茯苓陈皮丸","白豆蔻丸","百补养原丸","补中益气丸","补天丹","补气补血汤","补益钟乳丸","补真丸","补肾肾沥汤"," 补脾人参散","补脾和中丸","补脾神曲丸","补血养阴丸","补阴大造丸","补阴益脾汤","冲和顺气汤","参术健脾汤","参术地黄膏","参术柴苓汤","参术膏","参桂养荣丸","参橘散","参耆健中汤","参苓内托散","参苓建中汤","参苓白术散","参苓白术散","参贝六贤散","参附理中丸","常用冲寒散","柴前梅连散","柴前梅连散","柴芍六君丸","柴芍参苓散","沉香丸","沉香神曲煎","沉香陈曲丸","沉香饼","纯阳真人养脏汤","苍术汤","苍术膏","赤金丹","长春真人保命服食方","陈橘皮散","丁香建脾散","丹砂散","党参膏","地榆饮","地骨散","地骨皮丸","地骨皮散","地骨皮汤","大中汤","大保安汤","大效至圣千金饮子","大温经丸","大温经汤","大温脾圆","大肥儿丸","大芦荟丸","大荜茇丸","大补枳术丸","大补黄庭丸","大造丸","大造丸","大醒脾散","大顺散","大顺汤","度世丹","当归丸","当归川芎散","洞庭汤","胆道排石汤I号","调 中丸","调中和胃汤","调中归耆汤","调中沉香汤","调中畅脾膏","调卫养荣汤","调补中州散","二气双调饮","二神丸","阿胶饮子","伏龙肝汤","凤髓膏","分气饮","分涎散","妇女养营丸","妇宝胜金丹","扶元和 中膏","扶元汤","法制半夏","肥儿丸","肥儿丸","肥儿糕","茯苓内托散","茯苓渗湿汤","防己汤","防葵散","防风胜湿汤","防风饮","附子汤","附子汤","附子理中丸","附子理中汤","附子神曲丸","附子茴香散","附桂理中丸","古瓦汤","固真丹","固真饮子","干姜丸","干漆煎丸","归脾汤","归脾汤","枸杞还童丸","栝楼根散","桂曲丸","疳积饼","葛根散","葛花解酲汤","高良姜散","龟鹿二仙胶","龟鹿二仙胶","何人饮","何人饮","厚朴丸","厚朴汤","和气饮","和胃白术汤","河车回天丸","河车地黄丸","活脓散","琥珀丸","红花当归散","胡连芎归汤","胡黄连散","藿香正气散","藿香正气散","藿香饮","还少丹","黄病丸","黄耆九物汤","黄耆人参汤","黄耆白术散","黄耆鳖甲散","黄芩五味散","黄芩五物散","黄芩参苏饮","黑归脾丸","九味芦荟丸","九味资生丸","京三棱丸","健脾丸","健脾丸","健脾膏","加减参苓白术散","加减双解散","加减四物汤","加减天麻汤","加减归脾汤","加减扶元和中膏","加减玄武汤","加减补中益气汤","加减逍遥散","加减通圣散","加味八仙膏","加味六君子汤","加味十全大补汤","加味四君子汤","加味地黄丸"," 加味坎离丸","加味小柴胡汤","加味小青龙汤","加味异功散","加味枳术丸","加味生化补中益气汤","加味神术汤","加味补中益气汤","加味调中益气汤","加味逍遥丸","加味逍遥散","加味黄连解毒汤","劫劳散","姜附丸","姜附御寒汤","接命丹","橘术四物汤","橘皮丸","济坤大造丸","菊花浸酒","菊花酒","解糵汤","解郁活血汤","鲫鱼熟脍","鸡骨丸","坤厚资生丸","宽中养胃汤","开胸顺气丸","开胸顺气丸","快膈汤","款气丸","六合定中丸","六君加味汤","六君子汤","六君子汤","六攻散","六神散","六神散","凌花散","利膈丸","烂积丸","狼毒丸","理中丸","理冲丸","理冲汤","理冲汤","理气渗湿汤","理脾益营汤","硫黄丸","羚羊角丸","老鸡丸","鹿胶酒","鹿茸世宝丸","龙胆芦荟丸","龙齿丸","木香散","木香流气饮","木香豆蔻丸","木香顺气散","麻黄吴萸酒","内消散","宁坤至宝丹","培土养阴汤","脾肾双补丸","脾肾双补丸"," 蓬莪术散","七味白术散","千金养脾丸","千金大养脾圆","启脾散","人参养肺丸","人参养荣丸","人参养荣汤","人参养血丸","人参茯苓粥","人参黄耆散","茸珠丸","双补丸","四君子丸","四君子汤","四君子汤","失笑丸","失笑丸","实脾散","实脾散","寿胎丸","寿胎丸","山楂化滞丸","山药茯苓包子","柿钱散","桑螵蛸散","桑螵蛸散","溯源救肾汤","熟地黄散","生化汤","生化汤","首乌延寿丹","天门冬丸","天门冬酒","葶苈苦参散","调经丸","五仁润肠丸","五加皮汤","吴茱萸散","吴茱萸汤","温脾散","小建中合剂","新定拯阳理劳汤","续嗣降生丹","香朴丸","香砂六君丸","香砂六君子丸","香砂枳术丸","一志汤","养心定悸膏","养脾肥儿丸","养荣汤","右归丸","右归丸","右归酒","毓麟珠","毓麟珠","玉泉丸","益气导溺汤","茵陈五苓散","茵陈五苓散","茵陈四逆汤","增损乐令汤","增损柴胡汤","拯阴理劳汤","枳术丸","滋阴降火汤","滋阴降火汤","炙肝散","真人养脏汤","紫菀散","苎根汤","资成汤","资生丸","资生丸","镇心丹"]

connection.end();
